org-autosort.org
#+AUTHORS: yantar92
#+EMAIL: yantar92@gmail.com
#+OPTIONS: tags:nil todo:nil num:nil
#+PROPERTY: header-args :tangle no

* NEXT Automatic sorting of items in org mode                        :COMMON:
:LOGBOOK:
- State "NEXT"       from "NEXT"       [2018-01-01 Mon 13:31]
- State "NEXT"       from "NEXT"       [2018-01-01 Mon 13:21]
CLOCK: [2017-12-25 Mon 21:58]--[2017-12-25 Mon 22:00] =>  0:02
:END:
** Motivation
For now, standard org capabilities allow to sort entries in the agenda
views automatically. However, sorting of the actual org files is
rather limited. We only have =org-sort= function, which allows to sort
by one criteria only (not like =org-agenda-sorting-strategy= with
multiple sort criteria). Moreover, it can be done manually only.  

Sometimes, one may have a need to look at some kind of long list of
TODO items (for example, this infinitely growing list of things you
wish to do one day, or list of ideas). It is not comfortable to scroll
across such kind of list to look for specific item. Sorting is
something, that can help here.

*************** TODO Add some example here              :NOEXPORT:
*************** END

Of course, you can still use =org-sort= or agenda view with restriction
to the current subtree, but it may be disrupting if you want to look
through multiple of such a lists.  

The solution is to implement automatic sorting of subtrees in org
files.

** Overview
This package aims to implement an automatic sorting of the subtrees
in org files. The sorting order can be set globally through all the
org files, locally in file, or locally in a subtree using =:SORT:=
property.  

Everything, except global sorting order, can be set using standard
inheritance capabilities of the org properties (file local, subtree
local with or without inheritance for subtrees inside the
subtree). Global sorting order can be set via
=org-autosort-global-sorting-strategy= variable.

** Configuration

Both =:SORT:= property and =org-autosort-global-sorting-strategy=
are lists, which determine how to sort the entries.

<<org-autosort-global-sorting-strategy>>
=org-autosort-global-sorting-strategy= defines how to sort entries by
default. It is a list of [[sorting rules][sorting rules]], defining the comparison
between sorted entries. First, the entries are sorted via first rule
from the list. If the calculated keys are equal, second rule is used,
and so on.

=:SORT:= can be either =nil=, =t=, or the same format as
=org-autosort-global-sorting-strategy=:
- =t= :: use =org-autosort-global-sorting-strategy=
- not defined or =nil= :: sort if =org-autosort-sort-all= is non =nil=
- empty or =none= :: do not sort entries
- list :: define separate sorting strategy 

The sorting can be done after:
- opening the org file
- =org-autosort-sort-entries-at-point= command
- =org-autosort-sort-entries-in-file= command
(see [[sorting triggers][sorting triggers]] for details)

** Defaults
:PROPERTIES:
:CREATED:  [2017-12-25 Mon 16:06]
:END:
The package provide some predefined sorting rules <<sorting rules>>,
all are listed in =org-autosort-functions-alist=.

#+begin_src emacs-lisp :noweb yes
<<autosort-functions>>
#+end_src

You can control automatic sorting by setting <<sorting triggers>>

#+BEGIN_SRC elisp :noweb yes
<<autosort-triggers>>
#+END_SRC

Default [[org-autosort-global-sorting-strategy][sorting strategy]] is

#+BEGIN_SRC elisp :noweb yes
<<autosort-default-strategy>>
#+END_SRC

** NEXT Implementation                                            :NOEXPORT:
:PROPERTIES:
:header-args: :tangle yes
:END:
:LOGBOOK:
CLOCK: [2017-12-10 Sun 17:36]--[2017-12-10 Sun 20:02] =>  2:26
CLOCK: [2017-12-10 Sun 10:21]--[2017-12-10 Sun 11:02] =>  0:41
:END:
*** DONE Header
CLOSED: [2017-12-11 Mon 15:58]
:PROPERTIES:
:ID:       3e603efc-e71a-4520-bcef-265cff481455
:END:
#+begin_src emacs-lisp
;;; org-autosort.el --- Sort entries in org files automatically -*- lexical-binding: t; -*-

;; Version: 0.11
;; Author: Ihor Radchenko <yantar92@gmail.com>
;; Created: 10 Dec 2017
;; Keywords: matching, outlines
;; Homepage: https://github.com/yantar92/org-autosort
;; Package-Requires: (org)

;;; Commentary:

;; This package aims to implement an automatic sorting of the subtrees in org files.
;; The sorting order can be set globally through all the org files, locally in file, or locally in a subtree using :SORT: property.

;;; Code:
#+end_src
*** DONE Custom variables
CLOSED: [2017-12-18 Mon 21:23]
:PROPERTIES:
:ID:       08e58824-f88a-4d3b-a79e-00a1514eb68a
:END:
:LOGBOOK:
CLOCK: [2017-12-10 Sun 17:13]--[2017-12-10 Sun 17:33] =>  0:20
CLOCK: [2017-12-10 Sun 11:03]--[2017-12-10 Sun 11:35] =>  0:32
CLOCK: [2017-12-10 Sun 11:02]--[2017-12-10 Sun 11:03] =>  0:01
:END:
#+begin_src emacs-lisp
(defgroup org-autosort nil
  "Customization options of org-autosort package.")
#+end_src
- to sort or not to sort
#+begin_src emacs-lisp
(defcustom org-autosort-sort-all nil
  "Sort entries if :SORT: property is not defined.")
#+end_src
- auto sort triggers
#+name: autosort-triggers
#+begin_src emacs-lisp
(defcustom org-autosort-sort-at-file-open t
  "Non nil states for sorting of all items in the org file after opening."
  :type '(boolean))
#+end_src
- predefined sorts
#+name: autosort-functions
#+begin_src emacs-lisp
(defcustom org-autosort-functions-alist '((todo-up-0 . (:key org-autosort-get-todo :cmp <)) ; default org-sort comparison
					  (todo-down-0 . (:key org-autosort-get-todo :cmp >))
					  ;; compare according to `org-autosort-todo-cmp-order'
					  (todo-up . (:key org-get-todo-state :cmp org-autosort-custom-cmp-todo))
					  (todo-down . (:key org-get-todo-state :cmp (lambda (a b)
										       (not (org-autosort-custom-cmp-todo a b)))))
					  ;;					  
					  (text-up . (:key org-autosort-get:cmp :cmp string<))
					  (text-down . (:key org-autosort-get-text :cmp string>))
                                          (priority-up . (:key (org-autosort-get-property "PRIORITY") :cmp string<))
                                          (priority-down . (:key (org-autosort-get-property "PRIORITY") :cmp string>)))
  "Alist, defining aliases to sorting rules.
Each value in the list defines a sorting rule.
The rule is a property list with :key and :cmp properties.

:key property defines a function to calculate the key value.
:cmp property defines a function to compare the keys.
In both cases, function can be defined as
 1. lambda expression
 2. function symbol
 3. list, containing function symbol or lambda expression and their arguments

:key function is called with pos at the entry, without arguments.
If :key is defined as in 3, all the nesessary arguments should be in the list.

:cmp function must accept two arguments (after all the arguments as in 3).
It must satisfy the rules of cmp function for `sort'.
If :cmp is omitted, `org-autosort-default-cmp-function' is used."
  :type '(alist :key-type symbol
		:value-type (plist :value-type (choise function
						       (list function (repeat sexp))))))

(defcustom org-autosort-default-cmp-function #'string<
  "Default function, used to compare two entry keys.
Can be also a list of function and its arguments.
It is used if cmp function is not defined.
It must accept two arguments - first and second sorting key to compare.
Non nil return value means that first key is lesser than second key."
  :type '(function))
#+end_src
- default sorting strategy
#+name: autosort-default-strategy
#+begin_src emacs-lisp
(defcustom org-autosort-global-sorting-strategy '(priority-down todo-up)
  "Sorting strategy, used to sort entries with :SORT: property not set or nil.
This is a list, which elements can be:
- key of the sorting rule from `org-autosort-functions-alist'
- sorting rule, defined as in `org-autosort-functions-alist'
- :key values as from `org-autosort-functions-alist'
Sorting rules are applied accorting the their position in the list.
nil means that no sorting should be done by default."
  :type '(choice symbol
		 (plist :value-type (choise function
					    (list function (repeat sexp))))))
#+end_src
*** NEXT Standard sorting functions
:PROPERTIES:
:ID:       c478d941-ddbf-49cc-b38c-a03c33779817
:END:
:LOGBOOK:
CLOCK: [2017-12-18 Mon 20:59]--[2017-12-18 Mon 21:21] =>  0:22
CLOCK: [2017-12-10 Sun 17:08]--[2017-12-10 Sun 17:13] =>  0:05
:END:
**** NEXT List compare function
:PROPERTIES:
:CREATED:  [2017-12-29 Fri 05:48]
:END:
Compare arguments according to the list argument provided, so that
matching items will be sorted as in the list, and non matching will be
moved to the end. List entries can be regex.
**** NEXT by property
:PROPERTIES:
:ID:       51552471-6f2b-4792-a8a3-b4bb0d3618d8
:END:
#+begin_src emacs-lisp 
(defun org-autosort-get-property (property)
  "Get the value of PROPERTY for sorting."
  (org-entry-get (point)
		 property
		 'selective))
#+end_src
**** NEXT By todo keyword
:PROPERTIES:
:ID:       0d4d78c1-a4a2-4091-8142-ea9e70434d73
:END:
#+begin_src emacs-lisp 
(defun org-autosort-get-todo ()
  "Get the value of todo keyword for sorting." ; stolen from org-sort-entries in org.el
  (let* ((m (org-get-todo-state))
	 (s (if (member m
			org-done-keywords) '- '+))
	 )
    (- 99
       (funcall s
		(length (member m
				org-todo-keywords-1))))))
#+end_src
**** NEXT By todo keyword, custom
:PROPERTIES:
:ID:       87e5b164-fe1f-4618-9b07-741c27e37bc0
:END:
#+BEGIN_SRC emacs-lisp
(defvar org-autosort-todo-cmp-order nil
  "Order of todo keywords to be shown in sorted subtrees.
       Follow `org-todo-keywords-1' if nil."
  )
(defun org-autosort-custom-cmp-todo (a b)
  "Compare todo keywords A and B.  Return non nil if A<B."
  (let* ((todo-cmp-orgder (or org-autosort-todo-cmp-order
			      org-todo-keywords-1))
	 (posa (or (seq-position org-autosort-todo-cmp-order
				 a)
		   0))
	 (posb (or (seq-position org-autosort-todo-cmp-order
				 b)
		   0)))
    (< posa posb)))
#+END_SRC
**** NEXT Alphabetic
SCHEDULED: <2017-12-12 Tue>
:PROPERTIES:
:ID:       5205ed5d-cb92-4711-86b7-c2bf9549f0f5
:END:
:LOGBOOK:
CLOCK: [2017-12-18 Mon 20:33]--[2017-12-18 Mon 20:50] =>  0:17
:END:
#+BEGIN_SRC emacs-lisp
(defun org-autosort-get-text ()
  "Get the text or tags (if text is empty) of the current entry."
  (nth 4 (org-heading-components))
  )
#+END_SRC
**** TODO By first inactive timestamp
**** TODO By deadline
**** TODO By clocking time
**** TODO Numerically, beginning of the entry/item
**** TODO By scheduled time/date
