org-autosort.org
**** TODO By active timestamp
**** TODO By any timestamp
*** DONE [#A] General sorting routine
CLOSED: [2017-12-25 Mon 22:00] SCHEDULED: <2017-12-18 Mon>
:PROPERTIES:
:ID:       7b077f97-a744-4197-9b4f-015af71ab95f
:END:
:LOGBOOK:
CLOCK: [2017-12-25 Mon 15:14]--[2017-12-25 Mon 15:18] =>  0:04
- Note taken on [2017-12-18 Mon 21:21] \\
  Lambda cannot be recognized in sorting strategy since it is a list. Need to do something with it.
  CLOCK: [2017-12-10 Sun 20:48]--[2017-12-10 Sun 22:40] =>  1:52
  CLOCK: [2017-12-10 Sun 16:24]--[2017-12-10 Sun 17:36] =>  1:12
  CLOCK: [2017-12-10 Sun 16:05]--[2017-12-10 Sun 16:06] =>  0:01
  CLOCK: [2017-12-10 Sun 14:17]--[2017-12-10 Sun 16:02] =>  1:45
  CLOCK: [2017-12-10 Sun 11:35]--[2017-12-10 Sun 13:58] =>  2:23
:END:
#+begin_src emacs-lisp
(defun org-autosort-sorting-strategy-elementp (elm)
  "Validate element ELM of sorting strategy.  Return (:key ... [:cmp ...]) if element and nil otherwise."
  (pcase elm
    (`(quote val)
     (org-autosort-sorting-strategy-elementp val))
    ((pred functionp)
     (list :key elm))
    ((pred (lambda (arg) (assoc arg org-autosort-functions-alist)))
     (alist-get elm org-autosort-functions-alist))
    ((pred (lambda (arg) (plist-get arg :key)))
     (let ((key (org-autosort-sorting-strategy-elementp (plist-get elm :key)))
	   (cmp (org-autosort-sorting-strategy-elementp (plist-get elm :cmp))))
       (cond ((and key (not cmp)) key)
	     ((and key cmp) (plist-put key :cmp (plist-get cmp :key)))
	     (t nil))))
    (`(,func . ,args)
     (if (functionp func)
	 (list :key elm)
       nil))
    (_ nil)))

(defun org-autosort-sorting-strategyp (sorting-strategy)
  "Validate if SORTING-STRATEGY is a valid and return it.
The strategy is ensured to be a list.
Signal user error and return nil if argument is not a sorting strategy."
  (if (not sorting-strategy)
      nil
    (or (let ((res (org-autosort-sorting-strategy-elementp sorting-strategy)))
	  (if res (list res)))
	(let* ((testresult (mapcar (lambda (elm) (cons (org-autosort-sorting-strategy-elementp elm)
						  elm))
				   sorting-strategy))
	       (err-elm (alist-get nil testresult 'none)))
	  (if (equal err-elm 'none)
	      sorting-strategy
	    nil
	    (user-error "org-autosort: Wrong element of sorting strategy: \"%s\" in buffer: %s"
			err-elm (buffer-name)))))))

(defun org-autosort-get-sorting-strategy ()
  "Get sorting strategy at point for the current entry's subtree being sorted."
  (let ((property (org-entry-get (point) "SORT" 'selective)))
    (pcase property
      ('t (org-autosort-sorting-strategyp org-autosort-global-sorting-strategy))
      ('nil (and org-autosort-sort-all
	       (org-autosort-sorting-strategyp org-autosort-global-sorting-strategy)))
      ("" nil)
      ('none nil)
      (_ (if (= (cdr (read-from-string property))
		(length property))
	     (org-autosort-sorting-strategyp (car (read-from-string property)))
	   (user-error "org-autosort: Cannot read :SORT: property: \"%s\" in buffer: %s" property (buffer-name))
	   nil)))))

(defun org-autosort-construct-get-value-function-atom (sorting-strategy-elm)
  "Construct get-value function for single element of sorting strategy (SORTING-STRATEGY-ELM)."
  (let ((key (plist-get (org-autosort-sorting-strategy-elementp sorting-strategy-elm) :key)))
    (pcase key
      ((pred functionp)
       key)
      (`(,func . ,args)
       (when (functionp func)
	 (lambda () (apply (car key) (cdr key)))))
      ('nil (lambda () nil)))))

(defun org-autosort-construct-get-value-function ()
  "Return get-value function at point.
This function returns a list of sorting keys."
  (let ((sorting-strategy (org-autosort-get-sorting-strategy)))
    (if sorting-strategy
	(let ((func-list (mapcar #'org-autosort-construct-get-value-function-atom sorting-strategy)))
	  (lambda () (mapcar #'funcall func-list)))
      (lambda () (list nil)))))

(defun org-autosort-construct-cmp-function-atom (sorting-strategy-elm)
  "Construct cmp function for single element of sorting strategy (SORTING-STRATEGY-ELM)."
  (let* ((sorting-strategy-elm (org-autosort-sorting-strategy-elementp sorting-strategy-elm))
	 (cmp (and sorting-strategy-elm
		   (or (plist-get sorting-strategy-elm :cmp)
		       org-autosort-default-cmp-function))))
    (pcase cmp
      ((pred functionp)
       (lambda (a b) (funcall cmp a b)))
      (`(,func . ,args)
       (when (functionp func)
	 (lambda (a b) (apply func a b args))))
      ('nil (lambda (a b) nil)))))

(defun org-autosort-construct-cmp-function ()
  "Return cmp function at point."
  (let ((sorting-strategy (org-autosort-get-sorting-strategy)))
    (if (not sorting-strategy)
	(lambda (lista listb) nil)
      (let ((cmp-func-list (mapcar #'org-autosort-construct-cmp-function-atom sorting-strategy)))
	(lambda (lista listb)
	  (let ((resultlist (seq-mapn (lambda (func a b)
					(cons (funcall func a b)
					      (funcall func b a)))
				      cmp-func-list lista listb)) ; list of cons (a<b . b<a)
		(done nil)
		result)
	    (while (and (not done)
			(not (seq-empty-p resultlist)))
	      (let ((elem (pop resultlist)))
		(unless (and (car elem)
			   (cdr elem)) ; not equal
		  (setq done t)
		  (setq result (car elem)))))
	    result))))))

(defun org-autosort-org-sort-entries-wrapper (&rest args)
  "Run `org-sort-entries' at point with ARGS if nesessary.
Make sure, folding state is not changed."
  (when (org-autosort-get-sorting-strategy)
    (save-excursion
      (save-restriction
	(condition-case err
	    (apply #'org-sort-entries args)
	  (user-error
	   (unless (string-match-p "Nothing to sort"
				   (error-message-string err))
	     (signal (car err) (cdr err)))))))))

(defun org-autosort-sort-entries-at-point-nonrecursive ()
  "Sort org-entries at point nonrecursively."
  (interactive)
  (funcall #'org-autosort-org-sort-entries-wrapper
	   nil ?f
	   (org-autosort-construct-get-value-function)
	   (org-autosort-construct-cmp-function)))

(defun org-autosort-sort-entries-at-point-recursive ()
  "Sort org-entries at point recursively."
  (interactive)
  (condition-case err
      (org-map-entries (lambda nil (funcall #'org-autosort-org-sort-entries-wrapper
				     nil ?f
				     (org-autosort-construct-get-value-function)
				     (org-autosort-construct-cmp-function)))
		       nil 'tree)
    (error
     (if (string-match-p "Before first headline at position"
			 (error-message-string err))
	 (org-map-entries (lambda nil (funcall #'org-autosort-org-sort-entries-wrapper
					nil ?f
					(org-autosort-construct-get-value-function)
					(org-autosort-construct-cmp-function)))
			  nil 'file)
       (signal (car err) (cdr err))))))

(defun org-autosort-sort-entries-at-point (&optional ARG)
  "Sort org entries at point.
Sort recursively if invoked with \\[universal-argument]."
  (interactive "P")
  (if (equal ARG '(4))
      (org-autosort-sort-entries-at-point-recursive)
    (org-autosort-sort-entries-at-point-nonrecursive)))

(defun org-autosort-sort-entries-in-file ()
  "Sort all entries in the file recursively."
  (interactive)
  (org-map-entries (lambda nil (funcall #'org-autosort-org-sort-entries-wrapper
				 nil ?f
				 (org-autosort-construct-get-value-function)
				 (org-autosort-construct-cmp-function)))
		   nil 'file))

(defun org-autosort-sort-entries-in-file-maybe ()
  "Sort all entries in the file recursively if `org-autosort-sort-at-file-open' is not nil."
  (when org-autosort-sort-at-file-open (org-autosort-sort-entries-in-file)))

(add-hook 'org-mode-hook #'org-autosort-sort-entries-in-file-maybe)
#+end_src
*** DONE File epilogue
CLOSED: [2017-12-10 Sun 19:40]
:PROPERTIES:
:ID:       cf53b069-fcbb-45f9-9a80-e05f88d1fec5
:END:
#+begin_src emacs-lisp 
(provide 'org-autosort)

;;; org-autosort.el ends here
#+end_src
** Ideas                                                     :SKIP:NOEXPORT:
:PROPERTIES:
:SORT:     (todo-down)
:END:
*** TODO Sort only items, matching org search regex
*** TODO should be able to define alias in sorting strategy
:PROPERTIES:
:CREATED:  [2017-12-18 Mon 20:58]
:END:
:LOGBOOK:
CLOCK: [2017-12-18 Mon 20:58]--[2017-12-18 Mon 20:59] =>  0:01
:END:
*** TODO use local hook in autosort for toggle hooks
:PROPERTIES:
:CREATED:  [2017-12-20 Wed 15:23]
:END:
*** TODO add this functionality? [[http://sachachua.com/blog/2017/12/sorting-org-mode-lists-using-a-sequence-of-regular-expressions/][Sorting Org Mode lists using a sequence of regular expressions  13]] :COMMON:
:PROPERTIES:
:CREATED:  [2017-12-21 Thu 23:50]
:Source:   http://sachachua.com/blog/2017/12/sorting-org-mode-lists-using-a-sequence-of-regular-expressions/
:END:
*** TODO Add trigger to not read lisp from sort property it is not safe
:PROPERTIES:
:CREATED:  [2017-12-25 Mon 22:05]
:END:
