org-autosort.org
*** TODO sort signalling error -resolve [[id:e9132d5f-cc43-4bae-b9ed-244e21e8b8cc][Test test]]
:PROPERTIES:
:CREATED: [2017-12-29 Fri 22:37]
:END:
:LOGBOOK:
CLOCK: [2017-12-29 Fri 22:37]--[2017-12-29 Fri 22:38] =>  0:01
:END:
** NEXT Versions                                                  :NOEXPORT:
:PROPERTIES:
:CREATED:  [2017-12-28 Thu 23:15]
:END:
:LOGBOOK:
CLOCK: [2017-12-29 Fri 05:59]--[2017-12-29 Fri 06:00] =>  0:01
:END:
*** NEXT 1.0
:PROPERTIES:
:CREATED:  [2017-12-28 Thu 23:15]
:ORDERED:  t
:END:
:LOGBOOK:
CLOCK: [2017-12-29 Fri 05:50]--[2017-12-29 Fri 05:59] =>  0:09
:END:
- =org-agenda-sorting-strategy= like sorting specs <<v1.1>>
- sort entries in file on open <<v1.2>>
- sort entries in place <<v1.3>>
- sort lists <<v1.4>>
- construct comparison function with the list of items/regex, which
  should be placed on the top no matter what <<v1.5>>
- update the sort on changes, including creating new entries <<v1.6>>
- interactive sort via subtree agenda invocation, similar to filtering
  <<v1.7>>
*************** TODO Make it noweb refs, insert into files
*************** END

**** NEXT [#A] 0.1
SCHEDULED: <2018-01-13 Sat>
:PROPERTIES:
:CREATED:  [2017-12-28 Thu 23:16]
:END:
[[v1.1][specs]], [[v1.2][on open]]
***** DONE 0.10
CLOSED: [2018-01-01 Mon 13:21]
:PROPERTIES:
:CREATED:  [2018-01-01 Mon 13:18]
:END:
:LOGBOOK:
- State "DONE"       from              [2018-01-01 Mon 13:21]
:END:
****** DONE allow to define sort criteria like a lisp function in the properties field
CLOSED: [2017-12-12 Tue 21:18]
****** CANCELLED Take care about exact position for =C-c C-c= (say, we are inside the table - user may not want to sort) :CANCELLED:
CLOSED: [2017-12-11 Mon 16:56]
:LOGBOOK:
- State "CANCELLED"  from "TODO"          [2017-12-11 Mon 16:56]
:END:
****** CANCELLED do not use org-sort, because it does not allow to combine sorts (i.e. sort by one criteria, if equal - by other) :CANCELLED:
CLOSED: [2017-12-12 Tue 21:18]
:LOGBOOK:
- State "CANCELLED"  from "TODO"          [2017-12-12 Tue 21:18] \\
  Made a proper wrapper
:END:
***** DONE 0.11
CLOSED: [2018-01-01 Mon 13:21]
:PROPERTIES:
:CREATED:  [2018-01-01 Mon 13:18]
:END:
:LOGBOOK:
- State "DONE"       from              [2018-01-01 Mon 13:21]
:END:
****** DONE put buffer name in error report for wrong element of sorting strategy
CLOSED: [2017-12-25 Mon 21:59]
:PROPERTIES:
:CREATED:  [2017-12-18 Mon 20:57]
:END:
****** DONE Handle nothing to sort
CLOSED: [2017-12-11 Mon 16:56] SCHEDULED: <2017-12-11 Mon>
:LOGBOOK:
CLOCK: [2017-12-11 Mon 16:24]--[2017-12-11 Mon 16:56] =>  0:32
CLOCK: [2017-12-11 Mon 15:58]--[2017-12-11 Mon 16:08] =>  0:10
:END:
****** DONE make interactive versions of sorting functions
CLOSED: [2017-12-25 Mon 21:59]
****** DONE rewrite sorting strategy to use assoc lists
CLOSED: [2017-12-25 Mon 21:58]
:PROPERTIES:
:CREATED:  [2017-12-18 Mon 21:21]
:END:
:LOGBOOK:
CLOCK: [2017-12-25 Mon 15:18]--[2017-12-25 Mon 21:58] =>  6:40
CLOCK: [2017-12-18 Mon 21:21]--[2017-12-18 Mon 21:25] =>  0:04
:END:
****** DONE do not raise error but put a message and do not sort on wrong :SORTING: format
CLOSED: [2017-12-25 Mon 22:00]
:PROPERTIES:
:CREATED:  [2017-12-23 Sat 11:21]
:END:
***** NEXT 0.12
:PROPERTIES:
:CREATED:  [2018-01-01 Mon 13:21]
:END:
****** TODO add hooks to to autosort
:PROPERTIES:
:CREATED:  [2017-12-18 Mon 09:56]
:END:
****** NEXT get rid of annoying unfolding after =org-sort=
:PROPERTIES:
:CREATED:  [2017-12-18 Mon 20:54]
:END:
:LOGBOOK:
CLOCK: [2017-12-18 Mon 20:57]--[2017-12-18 Mon 20:58] =>  0:01
CLOCK: [2017-12-18 Mon 20:54]--[2017-12-18 Mon 20:57] =>  0:03
:END:

**** TODO 0.2
:PROPERTIES:
:CREATED:  [2017-12-28 Thu 23:16]
:END:
:LOGBOOK:
- State "TODO"       from "NEXT"          [2018-01-01 Mon 13:22]
:END:
[[v1.3][interactive in place]],[[v1.4][list sort]], [[v1.5][comparison list]]
**** TODO 0.3
:PROPERTIES:
:CREATED:  [2017-12-28 Thu 23:16]
:END:
[[v1.6][adaptive sort update]]
***** TODO Share on reddit
:PROPERTIES:
:CREATED:  [2017-12-29 Fri 05:57]
:END:
**** TODO 0.4
:PROPERTIES:
:CREATED:  [2017-12-28 Thu 23:16]
:END:
[[v1.7][interactive sort via agenda]]
**** 0.5
:PROPERTIES:
:CREATED:  [2017-12-28 Thu 23:16]
:END:
**** 0.6
:PROPERTIES:
:CREATED:  [2017-12-28 Thu 23:16]
:END:
**** 0.7
:PROPERTIES:
:CREATED:  [2017-12-28 Thu 23:16]
:END:
**** 0.8
:PROPERTIES:
:CREATED:  [2017-12-28 Thu 23:16]
:END:
**** 0.9
:PROPERTIES:
:CREATED:  [2017-12-28 Thu 23:16]
:END:
**** 1.0
:PROPERTIES:
:CREATED:  [2017-12-28 Thu 23:16]
:END:
